Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་ཞིང་བསྒྲུབ་པ་དང་། རྒྱན་ཀྱང་མངོན་པར་སྒྲུབ་པ་ཡིན། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། ཆོས་དང་། སྐུ་ནམ་མཁའ་ལྟ་བུར་ཡང་རབ་ཏུ་འཇུག་ལ། གཟུགས་དང་། མཚན་དང་། དཔེ་བྱད་བཟང་པོ་བསྡུ་ཞིང་རྒྱན་མངོན་པར་བསྒྲུབ་པའང་མངོན་པར་སྒྲུབ་པ་ཡིན། དེ་བཞིན་གཤེགས་པའི་གསུང་རང་བཞིན་གྱིས་ཞི་ཞིང་བརྗོད་དུ་མེད་པའི་སྒྲ་དབྱངས་དང་ལྡན་པར་ཡང་ཡིད་ཆེས་ལ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པར་ཕྱེ་བའི་རྒྱན་མངོན་པར་བསྒྲུབ་པ་ཡང་མངོན་པར་སྒྲུབ་པ་ཡིན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སྐད་ཅིག་གཅིག་ཏུ་དུས་གསུམ་ཐུགས་སུ་ཆུད་པར་ཡང་ཁོང་དུ་ཆུད་ལ་དུས་དང་བསྒལ་པའི་གྲངས་མཚན་ཉིད་ཐ་དད་པ་ལའང་སེམས་ཅན་གྱི་བསམ་པ་རྣམ་པར་བསྒོམ་པའི་ཕྱིར་རྗེས་སུ་འཇུག་པ་ཡིན་ཏེ།
en: (7) He has the understanding gained through contemplating that the extent of a buddha realm is the same as that of space, but he accomplishes the accomplishment of establishing the adornments of a buddha realm. (8) He comprehends the dharmakāya nature of all buddhas but accomplishes the accomplishment of establishing the adornments that are the primary and secondary signs of the rūpakāya. (9) He has the certainty that the voice of the tathāgatas has the nature of quietude, is inexpressible, and has no sound, but he accomplishes the accomplishment of the adornments that are the pure distinct aspects of speech. (10) He comprehends that the buddha bhagavats know the three times in a single instant but engages with the various characteristics of the different numbers of eons in accordance with the different perceptions of beings.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །ཐབས་དང་ཤེས་རབ་ཀྱིས་མངོན་པར་བསྒྲུབས་པའི་ལམ་བརྩམ་པའི་ཁྱད་པར་འདི་བཅུས། བྱང་ཆུབ་སེམས་དཔའ་ས་དྲུག་པ་ལ་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་བྱས་པ།
en: “O jinaputras! Through these ten distinct undertakings within the path, which are accomplished through method and wisdom, the bodhisattva ascends from the sixth to the seventh bodhisattva bhūmi.

source: ས་བདུན་ཡོངས་སུ་གནོན་ཏོ། །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལམ་གྱི་ཚོགས་ཐབས་དང་ཤེས་རབ་ཀྱིས་མངོན་པར་བསྒྲུབ་པའི་ཁྱད་པར་སྣང་བར་གྱུར་པ་འདི་དག་མངོན་པར་བསྒྲུབས་པས། བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་ཡོངས་སུ་གནོན་ཅེས་བྱ་སྟེ།
en: “O jinaputras, in that way, the bodhisattva mahāsattva ascends to the seventh bhūmi of the bodhisattva by accomplishing the appearance of these different accomplishments through the method and wisdom accumulated on the path.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི།
en: “The bodhisattva who is on the seventh bodhisattva bhūmi apprehends countless realms of beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། འདུལ་བའི་ཕྲིན་ལས་ཚད་མེད་པ་ལ་འཇུག་གོ །འཇིག་རྟེན་གྱི་ཁམས་མང་པོ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི།
en: He apprehends the ripening of beings through the guiding activity of countless buddha bhagavats. He apprehends countless universes. He apprehends countless pure realms of the buddhas. He apprehends an immeasurable variety of phenomena. He apprehends the enlightenment through wisdom of countless buddha bhagavats.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །ཆོས་ཐ་དད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་མངོན་པར་འཚང་རྒྱ་བ་ཚད་མེད་པ་ལ་འཇུག་གོ །བསྐལ་པའི་གྲངས་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དུས་གསུམ་ཐུགས་སུ་ཆུད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སེམས་ཅན་གྱི་མོས་པའི་ཁྱད་པར་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་མཚན་དང་། སྐུ་གཟུགས་དང་སྐུ་སྣ་ཚོགས་སྟོན་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། དབང་པོ་ཐ་དད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་གསུང་བརྗོད་པས།
en: He apprehends countless eons. He apprehends the realization of the three times by countless buddha bhagavats. He apprehends the different aspirations of countless beings. He apprehends the countless manifestations of the rūpakāyas and names of the buddha bhagavats. He apprehends the immeasurable variety of thoughts and faculties of beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སེམས་ཅན་རྣམས་ཀྱི་སེམས་དང་སྤྱོད་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་འབྱམ་ཀླས་པ་ཐུགས་སུ་ཆུད་པ་ཚད་མྱེད་པ་ལ་འཇུག་གོ །ཉན་ཐོས་ཀྱི་ཐེག་པས་འབྱུང་བ་ལ་མོས་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ལམ་ཤིན་ཏུ་བསྟན་པའི་ཡེ་ཤེས་ལ་འཇུག་པ་ཚད་མེད་པ་ལ་འཇུག་ཅིང་མོས་པར་བྱེད་དོ།
en: He apprehends the ripening of countless beings by the speech of the buddha bhagavats. He apprehends the countless motivations and conducts of beings. He apprehends the comprehension of the immeasurable infinite wisdom of the buddha bhagavats. He apprehends countless aspirations for liberation through the Śrāvaka­yāna. He aspires to and apprehends the countless teachings of the path by the buddha bhagavats. He apprehends the countless completions of the wisdom of the Pratyeka­buddha­yāna.

source: །རང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡང་དག་པར་བསྒྲུབ་པ་ཤིན་ཏུ་རྫོགས་པར་བྱ་བ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་ཟབ་མོའི་སྒོར་འཇུག་པ་བསྟན་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྦྱོར་བ་ཚད་མེད་པ་ལ་འཇུག་གོ །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་ཡང་དག་པར་བསྒྲུབ་པ་ལ་འཇུག་པ་ཤིན་ཏུ་བསྟན་པ་ཚད་མེད་པ་ལ་འཇུག་གོ །དེ་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་ནི་དེ་ལྟར་ཚད་མེད་པ་སྟེ།
en: He apprehends the countless teachings by the buddha bhagavats for entering the doorway to profound wisdom. He apprehends the dedication of countless bodhisattvas to bodhisattva conduct. He apprehends countless teachings by the buddha bhagavats for apprehending the accomplishment of the Mahāyāna. “He thinks, ‘The range of activity of the tathāgata arhat samyak­sambuddhas is immeasurable;

source: དེ་ནི་བསྐལ་པ་བརྒྱ་ཕྲག་ཁྲག་ཁྲིག་དང་། བསྐལ་པ་སྟོང་ཕྲག་ཁྲག་ཁྲིག་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་ཁྲག་ཁྲིག་ནས་དེ་སྙེད་ཀྱི། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གིས་ཀྱང་བགྲང་བར་དཀའ་སྟེ།
en: it cannot be enumerated even in a billion eons, ten billion eons, a trillion eons, and so on, up to a quintillion eons.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དེ་བདག་གིས་ལྷུན་གྱིས་གྲུབ་པར་བསྒྲུབ་པར་བྱའོ། །རྟོག་པ་མེད་པ་དང་། རྣམ་པར་རྟོག་པ་མེད་པར་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: I will attain that range of activity of the buddha bhagavats and complete it effortlessly and without thought and conceptualization.’

source: །ཞེས་དེ་དེ་ལྟར་ཤིན་ཏུ་བརྟགས་པའི་ཡེ་ཤེས་དང་། མངོན་པར་ཤེས་པ་དང་ལྡན་ཞིང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མངོན་པར་བརྩོན་པ་ནི། ཐབས་དང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བསྒོམས་པའི་ལམ་གྱི་ཚོགས་རྒྱ་ཆེན་པོའི་ཡེ་ཤེས་ལ་མི་གཡོ་བའི་ཚུལ་གྱིས་ཡོངས་སུ་གནས་པ་ཡིན།
en: “Thus he has discriminating wisdom and clairvoyance and continuous application, so that he unwaveringly remains in the wisdom of the vast accumulations of the path of the cultivation of method and wisdom.

source: དེ་སྐད་ཅིག་གཅིག་ཏུ་ཡང་ལམ་མངོན་པར་བསྒྲུབ་པ་ལས་ལྡང་བར་མི་བྱེད་དེ།
en: He does not for an instant depart from the accomplishment of the path.

source: དེ་འགྲོ་ཡང་དེ་ལྟ་བུའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ཡིན།
en: He is engaged in the accomplishment of wisdom while walking.

source: འགྲེང་བ་དང་། འདུག་པ་དང་། ཉལ་བ་དང་། རྨི་ལམ་དག་ཏུ་ཡང་སྒྲིབ་པ་མེད་ཅིང་སྤྱོད་ལམ་ཐམས་ཅད་ལ་གནས་ཀྱང་རྣམ་པ་འདི་ལྟ་བུའི་ཡེ་ཤེས་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན།
en: Even while standing, sitting, lying down, or dreaming, he is free of obscuration;

source: དེའི་སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་ཡང་དག་པར་བསྒྲུབ་པ་ཡང་དག་པར་འབྱུང་ངོ་།
en: within every kind of activity he always has his mind on that kind of wisdom. With each motivation he accomplishes the bodhisattva’s ten perfections and the ten bodhisattva bhūmis.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་བཏང་བའི་སེམས་བསྐྱེད་པ་བྱུང་བ་རེ་རེ་ཞིང་ཡང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་དོན་དུ་ཡོངས་སུ་བསྔོ་བས་དེ་ལ་གང་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་ཚོལ་ཞིང་།
en: Every motivation of the bodhisattva mahāsattva, which is preceded by great compassion, is focused on the accomplishment of the Buddha’s Dharma and the wisdom of the tathāgatas.

source: སེམས་ཅན་རྣམས་ལ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཏོང་བ་འདི་ནི་དེའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: “(1) When he gives his roots of goodness to beings while seeking wisdom, that is his perfection of generosity;

source: །གང་ཉོན་མོངས་པའི་ཡོངས་སུ་གདུང་བ་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་འདི་ནི་དེའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: ) when he pacifies all the torment from the kleśas, that is his perfection of conduct;

source: །གང་སྙིང་རྗེ་དང་བྱམས་པ་སྔོན་དུ་འགྲོ་བས་སེམས་ཅན་ཐམས་ཅད་ལ་འཚིག་པ་མེད་པ་འདི་ནི་དེའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (3) when with compassion he is without anger toward any being, that is his perfection of patience;

source: །གང་གོང་ནས་གོང་དུ་དགེ་བའི་ཆོས་ཚོལ་བས་མི་ངོམས་པར་དམ་འཆའ་བ་འདི་ནི་དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (4) when he undertakes greater and greater virtue without ever being content, that is his perfection of diligence;

source: །གང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་དུ་བྱ་བའི་ཕྱིར། འགྱོད་པ་མེད་པའི་ལམ་དང་ལྡན་པ་འདི་ནི་དེའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (5) when without regret he remains on the path focused upon the wisdom of omniscience, that is his perfection of meditation;

source: །གང་རང་བཞིན་གྱིས་མ་སྐྱེས་པ་མངོན་དུ་གྱུར་པ་འདི་ནི་དེའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (6) when he has acceptance in the face of the birthless nature of all phenomena, that is his perfection of wisdom;

source: །གང་ཡེ་ཤེས་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པ་འདི་ནི་དེའི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (7) when he accomplishes limitless wisdom, that is his perfection of skillful methods;

source: །གང་གོང་ནས་གོང་དུ་ཡེ་ཤེས་ལ་དམིགས་ཤིང་མངོན་པར་བསྒྲུབ་པ་འདི་ནི་དེའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (8) when he accomplishes higher and higher prayers and wisdom, that is his perfection of prayer;

source: །གང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་དང་བདུད་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱིས་ལམ་ཡོངས་སུ་མི་ཆོད་པ་འདི་ནི་དེའི་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: (9) when all adversaries and all hosts of māras are unable to interrupt the path, that is his perfection of strength;

source: །གང་ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་པ་འདི་ནི་དེའི་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: and (10) his conclusive knowledge of all phenomena is his perfection of knowledge.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའི་ས་རིང་དུ་སོང་བ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་པོ་དེ་དག་དེ་ལྟར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། བསྡུ་པའི་དངོས་པོ་བཞི་ཡང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །བྱིན་གྱི་རླབས་བཅུ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མདོར་བསྡུ་ན་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་ཆོས་ཐམས་ཅད་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: “O jinaputras! In that way, the bodhisattva who resides on the seventh bodhisattva bhūmi, Gone Far, completes those ten perfections in each instant, and he also completes the four modes of attracting beings and the four states, the thirty-seven factors for enlightenment, the three doors to liberation, and in brief all the factors for enlightenment.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་རྒྱལ་བའི་སྲས་ཅི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: The bodhisattva Vimukti­candra then asked the bodhisattva mahāsattva Vajra­garbha, “O jinaputra!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པ་འབའ་ཞིག་གི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རམ། འོན་ཏེ་མ་ཡིན་གྱིས་ས་བཅུ་པོ་ཐམས་ཅད་ལ་འང་དེ་བཞིན་དུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར།
en: Does the bodhisattva mahāsattva complete these factors for enlightenment in each instant only on this seventh bhūmi, or are they completed in each instant on all ten bhūmis?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་ས་བཅུ་པོ་ཀུན་ལ་འང་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཡོངས་སུ་རྫོགས་པར་ལྟ་འགྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པོ་འདི་ལ་ནི་དེ་དག་པས་ལྷག་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: The bodhisattva’s factors for enlightenment are completed in each instant on all ten bodhisattva bhūmis, but they are particularly completed on the seventh bodhisattva bhūmi.

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་འདི་ནི་ནན་ཏན་དུ་བྱ་བའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པའི་སྤྱོད་པ་ཡོངས་སུ་གནོན་པ་སྟེ།
en: O jinaputras! It is because on this bodhisattva bhūmi there is the perfection of dedication to conduct and an ascent to wisdom and clairvoyance.

source: དེ་ལྟར་ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་ནི་སྨོན་ལམ་ཐམས་ཅད་ལ་ལྷག་པར་དམིགས་པས་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: “O jinaputras, on the first bodhisattva bhūmi the bodhisattva’s factors for enlightenment are complete in each instant because of his exceptional focus on all aspirations. On the second bhūmi, it is because of the elimination of the mind’s stains.

source: །གཉིས་པ་ལ་སེམས་ཀྱི་དྲི་མ་ཐམས་ཅད་བསྩལ་བས་གསུམ་པ་ལ་སྨོན་ལམ་རྣམ་པར་འཕེལ་བ་དང་། ཆོས་ཀྱི་སྣང་བ་ཐོབ་པས།
en: On the third bhūmi, it is because of the increase of aspiration and attaining the Dharma’s illumination.

source: བཞི་པ་ལ་ལམ་ལ་འཇུག་པས།
en: On the fourth bhūmi, it is because of comprehending the path.

source: ལྔ་པ་ལ་འཇིག་རྟེན་གྱི་སྤྱོད་པའི་རྗེས་སུ་འབྲང་བས།
en: On the fifth bhūmi, it is because of conformity with activities in the world.

source: དྲུག་པ་ལ་ཆོས་ཟབ་མོའི་སྒོར་འཇུག་པས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: On the sixth bhūmi, it is because of entering the door to the profound Dharma.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་སྐད་ཅིག་སྐད་ཅིག་ཏུ་ཡོངས་སུ་གྲུབ་པར་འགྱུར་རོ།
en: On this seventh bodhisattva bhūmi all the factors for enlightenment are complete in each instant because of causing the appearance of all the Buddha’s Dharma.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ནས་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པའི་བར་དུ་བྱང་ཆུབ་སེམས་དཔས་མངོན་པར་བསྒྲུབས་པའི་ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་སྦྱོར་བའི་ཡན་ལག་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་ཡན་ཅད་ལྷུན་གྱིས་གྲུབ་པར་ཡོངས་སུ་འགྲུབ་བོ།
en: The accomplishments from the first bodhisattva bhūmi until the seventh bodhisattva bhūmi have the factors of dedication to the accomplishment of wisdom. From the eighth bodhisattva bhūmi upward, they manifest effortlessly.

source: །ཀྱེ་རྒྱལ་བའི་སྲས།
en: “O jinaputras!

source: འདི་ལྟ་སྟེ། དཔེར་ན།
en: To give an analogy, it is like two universes:

source: ཀུན་ནས་ཉོན་མོངས་ཤིང་རྣམ་པར་དག་པའི་འཇིག་རྟེན་གྱི་ཁམས་དང་ཤིན་ཏུ་དག་པའི་འཇིག་རྟེན་གྱི་ཁམས་དག་གི་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་ནི་སྨོན་ལམ་དང་། ཐབས་དང་ཤེས་རབ་དང་མངོན་པར་ཤེས་པའི་སྟོབས་དང་། ཤུགས་ཆེན་པོ་མ་གཏོགས་པར་འདོད་འདོད་བརྒལ་བར་མི་ནུས་སོ།
en: one universe is pure and impure, and one universe is completely pure. It is so difficult to cross between these two universes that one cannot cross from one to the other without the power of aspiration, method, wisdom, and clairvoyance.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་འདྲེས་པ་དང་ཡོངས་སུ་དག་པའི་བར་ཡང་སྨོན་པ་དང་། ཐབས་དང་། ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དང་ཤུགས་ཆེན་པོ་མ་གཏོགས་པར། འདོད་འདོད་བརྒལ་བར་མི་ནུས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་སྨྲས་པ།
en: “O jinaputras, in the same way, one cannot cross over from mixed bodhisattva conduct to completely pure bodhisattva conduct without the power of aspiration, method, wisdom, clairvoyance, and knowledge.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་འོ་ན་ཅི་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཉོན་མོངས་པའི་སྤྱོད་པས་ཀུན་ནས་ཉོན་མོངས་པར་ཡིད་ཆེས་པར་བྱ་བ་ཡིན་ནམ།
en: The bodhisattva Vimukti­candra asked, “O jinaputra! Is bodhisattva conduct on the seventh bodhisattva bhūmi to be known as afflicted by the activity of the kleśas?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་རབ་ཏུ་དགའ་བ་ཉིད་བཟུང་བ་ཡན་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་དབང་གིས་ཉོན་མོངས་པའི་རྙོག་པ་དང་བྲལ་བར་གར་འོས་པའི་ཚུལ་གྱི་ལམ་མཉམ་པ་ཉིད་ཀྱིས་ཡིད་ཆེས་པར་བྱ་སྟེ།
en: It should be known that after the first bodhisattva bhūmi, Perfect Joy, is attained, all bodhisattva conduct is free from the stain of the kleśas because of the power of dedication to enlightenment, which is appropriately in accord with the path.

source: དེ་ཙམ་གྱིས་ས་བདུན་པོ་རྣམས་སུ་ཉོན་མོངས་པའི་སྤྱོད་པ་ལས་ཡང་དག་པར་འདས་ཤེས་ནི་མི་བྱའོ།
en: However, on the first seven bhūmis, that alone is not said to be transcending the conduct of the kleśas. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ནི་ལྷ་རྫས་ཀྱི་གླང་པོ་རིན་པོ་ཆེ་ལ་ཞོན་ཞིང་གླིང་བཞི་དག་ཏུ་འང་འགྲོ།
en: It is like when a cakravartin mounted on a divine precious elephant travels around the four continents.

source: མིའི་སྡུག་བསྔལ་དང་། ཕོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ཉེས་པ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་ཏེ། འོན་ཀྱང་ཉེས་པ་དེ་དག་གིས་གོས་པར་མི་འགྱུར་རོ།
en: He perceives all the suffering, poverty, and kleśas of human beings, but he is not defiled by any of those evils.

source: །དེ་ཙམ་གྱིས་མིའི་ལུས་ལས་ཡོངས་སུ་འདས་པ་འང་མ་ཡིན་ཏེ།
en: But this alone does not mean that he has transcended being a human.

source: ནམ་མིའི་ལུས་སྤངས་ཏེ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་པར་གྱུར་པ་དེའི་ཚེ་ནི་ཚངས་པའི་གཞལ་མེད་ཁང་ན་གནས་ཤིང་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་མཐོང་། དེ་དག་ཏུ་འང་འགྲོ་ཚངས་པའི་གཟུགས་བརྙན་ཡང་ཀུན་ཏུ་སྟོན་ཏེ་མི་ཞེས་ཀྱང་མི་བརྗོད་དོ།
en: After he has departed from his human body, he is born in the realm of Brahmā, dwells in the divine palace of Brahmā from where he can see a thousand universes, goes to them and appears in the form of Brahmā, and is not called a human.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་བཟུང་བ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཐེག་པ་ལ་ཞོན་ཞིང་འགྲོ་བ་ཐམས་ཅད་དུ་རྒྱུ་བའི་ཚེ་ཀུན་ནས་ཉོན་མོངས་པའི་ཉེས་པ་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་ཏེ་ཡང་དག་པའི་ལམ་དུ་ཞུགས་པས་ཀུན་ནས་ཉོན་མོངས་པ་དེ་དག་གིས་གོས་པར་ཡང་མི་འགྱུར་རོ།
en: “O jinaputras! In that same way, from the first bodhisattva bhūmi upward, the bodhisattva is mounted on the Pāramitāyāna, goes among all beings, and perceives all the evils of the kleśas, but he is not stained by those kleśas, because he is following the correct path.

source: །འོན་ཀྱང་དེ་ཙམ་གྱིས་བདུན་པོ་རྣམས་ལ་ཉོན་མོངས་པའི་ཉེས་པ་རྣམས་ལས་ཡང་དག་པར་འདས་ཤེས་ནི་མི་བྱ་སྟེ།
en: However, he is not said to transcend the evils of the kleśas on the seven bhūmis.

source: ནམ་སྦྱོར་བ་ཅན་གྱི་སྤྱོད་པ་ཐམས་ཅད་སྤངས་ཏེ་ས་བདུན་པོ་ནས་ས་བརྒྱད་པ་ཡོངས་སུ་ནོན་པར་གྱུར་ཏེ།
en: When he leaves behind all the conduct on the seventh bhūmi that arises from engagement, he ascends from the seventh bhūmi to the eighth bodhisattva bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ཡོངས་སུ་དག་པ་ལ་ཞོན་ཞིང་འགྲོ་བ་ཐམས་ཅད་དུ་རྒྱུ་བའི་ཚེ་ཀུན་ནས་ཉོན་མོངས་པའི་ཉེས་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་ཏེ། འཇིག་རྟེན་གྱི་བྱ་བ་ཀུན་ལས་འདས་པས་ཉེས་པ་དེ་དག་གིས་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ཅེས་མི་བྱའོ།
en: Then, mounted upon the pure Bodhisattva­yāna, he goes among beings and perceives all the evils of the kleśas, but he is not stained by those evils, because he has transcended all worldly activity.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་ཆགས་ལས་སྩོགས་པའི་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཀྱང་ཤིན་ཏུ་ཤས་ཆེ་བར་འདའ་སྟེ།
en: “O jinaputras! The bodhisattva on the seventh bodhisattva bhūmi has greatly transcended desire and all the kleśas.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཉོན་མོངས་པ་ཅན་ཞེས་ཀྱང་མི་བྱ། ཉོན་མོངས་པ་མེད་པ་ཞེས་ཀྱང་མི་བྱའོ།
en: The bodhisattva whose conduct is on this seventh bodhisattva bhūmi, Gone Far, is not said to have kleśas or to not have kleśas.

source: ཉོན་མོངས་པ་ཐམས་ཅད་རྒྱུ་བ་མེད་པས་ཉོན་མོངས་པ་ཅན་ཞེས་མི་བྱའོ།
en: He cannot be said to have kleśas because there is no conduct of the kleśas.

source: །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་མངོན་པར་འདོད་ཅིང་བསམ་པ་ཡོངས་སུ་མ་རྫོགས་པས་ཉོན་མོངས་པ་མེད་པ་ཞེས་ཀྱང་མི་བྱའོ།
en: He cannot be said to be without kleśas because he desires the wisdom of the tathāgatas and because his wish has not been fulfilled.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་པའི་ལུས་ཀྱི་ལས་དང་ལྡན་པ་ཡིན།
en: “In that way the bodhisattva who is on the seventh bodhisattva bhūmi has physical actions that are done through a pure motivation.

source: ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་པའི་ངག་གི་ལས་དང་ལྡན་པ་ཡིན།
en: He has vocal actions that are done through a pure motivation.

source: ལྷག་པའི་བསམ་པས་ཡོངས་སུ་དག་པའི་ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན།
en: He has mental actions that are done through a pure motivation.

source: དེ་ནི་འདི་ལྟར་མི་དགེ་བའི་ལས་ཀྱི་ལམ་དེ་བཞིན་གཤེགས་པས་སྨད་པ་ཀུན་ནས་ཉོན་མོངས་པ་དང་བཅས་པ་དེ་དག་ལས་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཡང་དག་པར་འདས་པས་འདས་པ་ཡིན། གང་འདི་དག་དགེ་བའི་ལམ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བསྔགས་པ་དེ་དག་གི་རྗེས་སུ་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་འབྲང་བ་ཡིན།
en: He completely transcends the paths of nonvirtue that have been condemned by the tathāgatas and are endowed with the kleśas. He continuously follows the paths of virtue that have been praised by the tathāgatas.

source: གང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ས་ལྔ་པ་ལ་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཇི་ལྟར་མངོན་པར་བསྒྲུབས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལྷུན་གྱིས་གྲུབ་པར་རབ་ཏུ་འབྱུང་ངོ་།
en: All the accomplishments of the activities of worldly skills on the fifth bodhisattva bhūmi are effortlessly accomplished.

source: །དེ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སློབ་དཔོན་དུ་བྱ་བ་ཡིན་ཏེ།
en: He becomes an ācārya for the great billion-world universe.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་ཡན་ཅད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་མ་གཏོགས་པར་སུ་འང་དེ་དང་བསམ་པ་འམ་སྦྱོར་བས་མཉམ་པ་མེད་དོ།
en: Apart from the tathāgata arhat samyak­sambuddhas and the bodhisattvas who are on the eighth bodhisattva bhūmi and higher, there is no one else who is his equal in thought and deed.

source: འདི་ལྟར་ཡང་གང་འདི་དག་བསམ་གཏན་རྣམས་དང་། ཏིང་ངེ་འཛིན་དག་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་དང་། མངོན་པར་ཤེས་པ་དག་དང་། རྣམ་པར་ཐར་པ་རྣམས་ཀྱང་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་བསྒོམ་པ་མངོན་པར་བསྒྲུབ་པའི་སྒོའི་ཚུལ་གྱིས་མངོན་དུ་འགྱུར་ཏེ། འོན་ཀྱང་ད་དུང་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ནི་རྣམ་པར་སྨིན་པས་ཡོངས་སུ་རྫོགས་པ་མ་ཡིན་ནོ།
en: He focuses on and accomplishes the meditation of every dhyāna, samādhi, samāpatti, clairvoyance, and liberation , but their ripening is not as complete as they are for the bodhisattva on the eighth bodhisattva bhūmi.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་ཐམས་ཅད་ལ་ཤེས་རབ་དང་། ཐབས་དང་། བསྒོམ་པའི་སྟོབས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Thus, whenever the bodhisattva on the seventh bodhisattva bhūmi develops an intention, it is fulfilled by the power of wisdom, method, and meditation.

source: སྔོན་བས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་རབ་ཏུ་འཐོབ་བོ།
en: More than ever before, he attains the completion of the factors for enlightenment.

source: །དེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བདུན་པ་འདི་ལ་གནས་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ཞེས་བྱ་བ་ལ་མཉམ་པར་གཞོག་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དོན་ཤིན་ཏུ་བསམ་པ་ཞེས་བྱ་བ་དང་། ཁྱད་པར་གྱི་བློ་གྲོས་ཤེས་བྱ་བ་དང་། རབ་ཏུ་ཕྱེ་བའི་དོན་གྱི་མཛོད་ཅེས་བྱ་བ་དང་། ཆོས་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་དང་། རྩ་བ་ཤིན་ཏུ་གནས་པས་བརྟན་པ་ཞེས་བྱ་བ་དང་། ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པའི་སྒོ་ཞེས་བྱ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཡོངས་སུ་སྦྱངས་པ་ཞེས་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཞེས་བྱ་བ་དང་། དོན་སྣ་ཚོགས་ཀྱི་མཛོད་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་སྒོ་ཞེས་བྱ་བ་ལ་ཡང་མཉམ་པར་གཞོག་སྟེ།
en: “Thus, when he is on the seventh bodhisattva bhūmi, he enters the bodhisattva samādhi called the complete differen­tiation of categories, the bodhisattva samādhi called the thorough contemplation of meaning, the bodhisattva samādhi called the understanding of differences, the bodhisattva samādhi called the treasure of differen­tiated meanings, the bodhisattva samādhi called the exact differen­tiation of meanings, the bodhisattva samādhi called the firmly established root, the bodhisattva samādhi called the doorway to wisdom and clairvoyance, the bodhisattva samādhi called the purification of the realm of phenomena, the bodhisattva samādhi called the benefitsof the tathāgatas, the bodhisattva samādhi called the treasure of various meanings that is the doorway to saṃsāra and nirvāṇa, and so on.
